module proof.CoercionEquality where

open import Agda.Builtin.List using ([])
open import Data.Product using (Σ-syntax; ∃-syntax; _×_; _,_)
open import Relation.Binary.PropositionalEquality using (_≢_; refl)

open import Types
open import proof.CoercionReduction

infix 4 _≈ᶜ_

data _≈ᶜ_ : Coercion → Coercion → Set where
  ≈-refl : ∀ {c}
    → c ≈ᶜ c

  ≈-sym : ∀ {c d}
    → c ≈ᶜ d
    → d ≈ᶜ c

  ≈-trans : ∀ {c d e}
    → c ≈ᶜ d
    → d ≈ᶜ e
    → c ≈ᶜ e

  ≈-↦ : ∀ {c₁ c₂ d₁ d₂}
    → c₁ ≈ᶜ c₂
    → d₁ ≈ᶜ d₂
    → singleᶜ (c₁ ↦ d₁) ≈ᶜ singleᶜ (c₂ ↦ d₂)

  ≈-⨟ : ∀ {c₁ c₂ d₁ d₂}
    → c₁ ≈ᶜ c₂
    → d₁ ≈ᶜ d₂
    → (c₁ ⨟ d₁) ≈ᶜ (c₂ ⨟ d₂)

  -- Rules mirroring one-step reduction rules.
  ≈-β-proj-inj-ok : ∀ {G ℓ}
    → singleᶜ (G !) ⨟ singleᶜ (G ？ ℓ) ≈ᶜ []

  ≈-β-proj-inj-bad : ∀ {G H ℓ}
    → G ≢ H
    → singleᶜ (G !) ⨟ singleᶜ (H ？ ℓ)
      ≈ᶜ singleᶜ (⊥ᶜ G ⇨ H at ℓ)

  ≈-β-idL : ∀ {d}
    → [] ⨟ d ≈ᶜ d

  ≈-β-idR : ∀ {c}
    → c ⨟ [] ≈ᶜ c

  ≈-β-assocL : ∀ {c₁ c₂ c₃}
    → (c₁ ⨟ (c₂ ⨟ c₃)) ≈ᶜ ((c₁ ⨟ c₂) ⨟ c₃)

  ≈-β-assocR : ∀ {c₁ c₂ c₃}
    → ((c₁ ⨟ c₂) ⨟ c₃) ≈ᶜ (c₁ ⨟ (c₂ ⨟ c₃))

  ≈-β-↦ : ∀ {c d c′ d′}
    → singleᶜ (c ↦ d) ⨟ singleᶜ (c′ ↦ d′)
      ≈ᶜ singleᶜ ((c′ ⨟ c) ↦ (d ⨟ d′))

  ≈-β-⊥L : ∀ {A B C d ℓ}
    → ⊢ d ⦂ B ⇨ᶜ C
    → singleᶜ (⊥ᶜ A ⇨ B at ℓ) ⨟ singleᶜ d
      ≈ᶜ singleᶜ (⊥ᶜ A ⇨ C at ℓ)

  ≈-β-!⊥ : ∀ {G B ℓ}
    → singleᶜ (G !) ⨟ singleᶜ (⊥ᶜ ★ ⇨ B at ℓ)
      ≈ᶜ singleᶜ (⊥ᶜ G ⇨ B at ℓ)

  ≈-β-↦⊥ : ∀ {c d A B C D E ℓ}
    → ⊢ c ⦂ C ⇨ A
    → ⊢ d ⦂ B ⇨ D
    → singleᶜ (c ↦ d) ⨟ singleᶜ (⊥ᶜ (C ⇒ D) ⇨ E at ℓ)
      ≈ᶜ singleᶜ (⊥ᶜ (A ⇒ B) ⇨ E at ℓ)

—→ᶜᶜ⇒≈ᶜ : ∀ {c d}
  → c —→ᶜᶜ d
  → c ≈ᶜ d
—→ᶜᶜ⇒≈ᶜ (ξ-pair β-proj-inj-okᶜ refl) =
  ≈-⨟ ≈-β-proj-inj-ok ≈-refl
—→ᶜᶜ⇒≈ᶜ (ξ-pair (β-proj-inj-badᶜ G≢H) refl) =
  ≈-⨟ (≈-β-proj-inj-bad G≢H) ≈-refl
—→ᶜᶜ⇒≈ᶜ (ξ-pair β-↦ᶜ refl) =
  ≈-⨟ ≈-β-↦ ≈-refl
—→ᶜᶜ⇒≈ᶜ (ξ-pair (β-⊥Lᶜ dwt) refl) =
  ≈-⨟ (≈-β-⊥L dwt) ≈-refl
—→ᶜᶜ⇒≈ᶜ (ξ-pair β-!⊥ᶜ refl) =
  ≈-⨟ ≈-β-!⊥ ≈-refl
—→ᶜᶜ⇒≈ᶜ (ξ-pair (β-↦⊥ᶜ cwt dwt) refl) =
  ≈-⨟ (≈-β-↦⊥ cwt dwt) ≈-refl
—→ᶜᶜ⇒≈ᶜ (ξ-∷ᶜ {c = c} c→c′) =
  ≈-⨟ {c₁ = singleᶜ c} ≈-refl (—→ᶜᶜ⇒≈ᶜ c→c′)
—→ᶜᶜ⇒≈ᶜ (ξ-↦₁ᶜ {d = d} {cs = cs} c→c′) =
  ≈-⨟ {d₁ = cs} (≈-↦ (—→ᶜᶜ⇒≈ᶜ c→c′) ≈-refl) ≈-refl
—→ᶜᶜ⇒≈ᶜ (ξ-↦₂ᶜ {c = c} {cs = cs} d→d′) =
  ≈-⨟ {d₁ = cs} (≈-↦ ≈-refl (—→ᶜᶜ⇒≈ᶜ d→d′)) ≈-refl

—↠ᶜᶜ⇒≈ᶜ : ∀ {c d}
  → c —↠ᶜᶜ d
  → c ≈ᶜ d
—↠ᶜᶜ⇒≈ᶜ (_ ∎ᶜᶜ) = ≈-refl
—↠ᶜᶜ⇒≈ᶜ (_ —→ᶜᶜ⟨ c→c₁ ⟩ c₁↠d) =
  ≈-trans (—→ᶜᶜ⇒≈ᶜ c→c₁) (—↠ᶜᶜ⇒≈ᶜ c₁↠d)

≈ᶜ-complete : ∀ {c d c′}
  → c —↠ᶜᶜ c′
  → d —↠ᶜᶜ c′
  → c ≈ᶜ d
≈ᶜ-complete c↠c′ d↠c′ =
  ≈-trans (—↠ᶜᶜ⇒≈ᶜ c↠c′) (≈-sym (—↠ᶜᶜ⇒≈ᶜ d↠c′))
