module CoercionNormalForm where

open import Data.Product using (Σ-syntax; ∃-syntax; _×_; _,_)
open import Relation.Binary.PropositionalEquality using (_≡_; refl; cong; cong₂)

open import Types
open import CoercionReduction

infix 7 _↣_
infix 5 _i⨟s_
infix 5 _g⨟i_
infix 5 _g⨟g_
infix 4 _⇨ⁿ_ _⇨ⁱ_ _⇨ᵍ_
infix 7 _?ⁿ_ _!ⁿ_
infix 6 _?ⁿ_⨾_ _?ⁿ_⨾_⨾! ‹_›_⨾_!ⁿ

mutual
  data _⇨ⁿ_ : Ty → Ty → Set
  data _⇨ⁱ_ : Ty → Ty → Set
  data _⇨ᵍ_ : Ty → Ty → Set

  data _⇨ⁿ_ where
    idⁿ : (A : Ty)
      → A ⇨ⁿ A
    _?ⁿ_ : ∀ (G : Ty)
      → Ground G
      → ★ ⇨ⁿ G
    _?ⁿ_⨾_ : ∀ (G : Ty) {B}
      → Ground G
      → G ⇨ⁱ B
      → ★ ⇨ⁿ B
    _?ⁿ_⨾_⨾! : ∀ (G : Ty)
      → Ground G
      → G ⇨ᵍ G
      → ★ ⇨ⁿ ★
    ′_ : ∀ {A B}
      → A ⇨ⁱ B
      → A ⇨ⁿ B

  data _⇨ⁱ_ where
    _!ⁿ_ : ∀ (G : Ty)
      → Ground G
      → G ⇨ⁱ ★
    ‹_›_⨾_!ⁿ : ∀ {A} (G : Ty)
      → A ⇨ᵍ G
      → Ground G
      → A ⇨ⁱ ★
    ＇_ : ∀ {A B}
      → A ⇨ᵍ B
      → A ⇨ⁱ B
    ⊥ⁿ_⇨_ : ∀ (A B : Ty)
      → A ⇨ⁱ B

  data _⇨ᵍ_ where
    idℕ : ℕ ⇨ᵍ ℕ
    id★⇒★ : (★ ⇒ ★) ⇨ᵍ (★ ⇒ ★)
    _↣_ : ∀ {A B C D}
      → C ⇨ⁿ A
      → B ⇨ⁿ D
      → (A ⇒ B) ⇨ᵍ (C ⇒ D)

mutual
  ⌊_⌋ˢ : ∀ {A B}
    → A ⇨ⁿ B
    → Coercion
  ⌊_⌋ⁱ : ∀ {A B}
    → A ⇨ⁱ B
    → Coercion
  ⌊_⌋ᵍ : ∀ {A B}
    → A ⇨ᵍ B
    → Coercion

  ⌊ idⁿ A ⌋ˢ = idᶜ A
  ⌊ G ?ⁿ _ ⌋ˢ = G `?
  ⌊ G ?ⁿ _ ⨾ i ⌋ˢ = G `? ⨟ ⌊ i ⌋ⁱ
  ⌊ G ?ⁿ _ ⨾ g ⨾! ⌋ˢ = (G `? ⨟ ⌊ g ⌋ᵍ) ⨟ G !
  ⌊ ′ i ⌋ˢ = ⌊ i ⌋ⁱ

  ⌊ G !ⁿ _ ⌋ⁱ = G !
  ⌊ ‹ G › g ⨾ _ !ⁿ ⌋ⁱ = ⌊ g ⌋ᵍ ⨟ G !
  ⌊ ＇ g ⌋ⁱ = ⌊ g ⌋ᵍ
  ⌊ ⊥ⁿ A ⇨ B ⌋ⁱ = ⊥ᶜ A ⇨ B

  ⌊ idℕ ⌋ᵍ = idᶜ ℕ
  ⌊ id★⇒★ ⌋ᵍ = idᶜ (★ ⇒ ★)
  ⌊ c ↣ d ⌋ᵍ = ⌊ c ⌋ˢ ↦ ⌊ d ⌋ˢ

mutual
  wtS : ∀ {A B} (s : A ⇨ⁿ B)
    → ⊢ ⌊ s ⌋ˢ ⦂ A ⇨ B
  wtI : ∀ {A B} (i : A ⇨ⁱ B)
    → ⊢ ⌊ i ⌋ⁱ ⦂ A ⇨ B
  wtG : ∀ {A B} (g : A ⇨ᵍ B)
    → ⊢ ⌊ g ⌋ᵍ ⦂ A ⇨ B

  wtS (idⁿ A) = ⊢idᶜ
  wtS (G ?ⁿ g) = ⊢? g
  wtS (G ?ⁿ g ⨾ i) = ⊢⨟ (⊢? g) (wtI i)
  wtS (G ?ⁿ g ⨾ h ⨾!) = ⊢⨟ (⊢⨟ (⊢? g) (wtG h)) (⊢! g)
  wtS (′ i) = wtI i

  wtI (G !ⁿ g) = ⊢! g
  wtI (‹ G › g ⨾ gnd !ⁿ) = ⊢⨟ (wtG g) (⊢! gnd)
  wtI (＇ g) = wtG g
  wtI (⊥ⁿ A ⇨ B) = ⊢⊥

  wtG idℕ = ⊢idᶜ
  wtG id★⇒★ = ⊢idᶜ
  wtG (c ↣ d) = ⊢↦ (wtS c) (wtS d)

mutual
  normalize-seq : ∀ {A B C}
    → (s : A ⇨ⁿ B)
    → (t : B ⇨ⁿ C)
    → ∃[ u ] ((⌊ s ⌋ˢ ⨟ ⌊ t ⌋ˢ) —↠ᶜᶜ ⌊ u ⌋ˢ)

  _i⨟s_ : ∀ {A B C}
    → (i : A ⇨ⁱ B)
    → (t : B ⇨ⁿ C)
    → ∃[ j ] ((⌊ i ⌋ⁱ ⨟ ⌊ t ⌋ˢ) —↠ᶜᶜ ⌊ j ⌋ⁱ)

  _g⨟i_ : ∀ {A B C}
    → (g : A ⇨ᵍ B)
    → (i : B ⇨ⁱ C)
    → ∃[ j ] ((⌊ g ⌋ᵍ ⨟ ⌊ i ⌋ⁱ) —↠ᶜᶜ ⌊ j ⌋ⁱ)

  _g⨟g_ : ∀ {A B C}
    → (g : A ⇨ᵍ B)
    → (h : B ⇨ᵍ C)
    → ∃[ k ] ((⌊ g ⌋ᵍ ⨟ ⌊ h ⌋ᵍ) —↠ᶜᶜ ⌊ k ⌋ᵍ)

  normalize-seq (idⁿ A) t =
    t
    , (((idᶜ A) ⨟ ⌊ t ⌋ˢ)
      —→ᶜᶜ⟨ β-idLᶜ ⟩
      ⌊ t ⌋ˢ
      ∎ᶜᶜ)

  normalize-seq (G ?ⁿ g) (idⁿ G) =
    G ?ⁿ g
    , (((G `?) ⨟ idᶜ G
      —→ᶜᶜ⟨ β-idRᶜ ⟩
      (G `?)
      ∎ᶜᶜ))

  normalize-seq (G ?ⁿ g) (′ i) =
    G ?ⁿ g ⨾ i
    , (((G `?) ⨟ ⌊ i ⌋ⁱ) ∎ᶜᶜ)

  normalize-seq (G ?ⁿ g ⨾ i) t
    with i i⨟s t
  ... | j , i⨟t↠j =
    G ?ⁿ g ⨾ j
    , ((((G `?) ⨟ ⌊ i ⌋ⁱ) ⨟ ⌊ t ⌋ˢ)
      —→ᶜᶜ⟨ β-assocRᶜ ⟩
      ((G `?) ⨟ (⌊ i ⌋ⁱ ⨟ ⌊ t ⌋ˢ))
      —↠ᶜᶜ⟨ multi-ξ-⨟₂ᶜᶜ i⨟t↠j ⟩
      ((G `?) ⨟ ⌊ j ⌋ⁱ)
      ∎ᶜᶜ)

  normalize-seq (G ?ⁿ g ⨾ h ⨾!) t
    with (‹ G › h ⨾ g !ⁿ) i⨟s t
  ... | j , h!⨟t↠j =
    G ?ⁿ g ⨾ j
    , (((((G `?) ⨟ ⌊ h ⌋ᵍ) ⨟ (G !)) ⨟ ⌊ t ⌋ˢ)
      —→ᶜᶜ⟨ ξ-⨟₁ᶜ β-assocRᶜ ⟩
      ((G `?) ⨟ (⌊ h ⌋ᵍ ⨟ (G !))) ⨟ ⌊ t ⌋ˢ
      —→ᶜᶜ⟨ β-assocRᶜ ⟩
      (G `?) ⨟ ((⌊ h ⌋ᵍ ⨟ (G !)) ⨟ ⌊ t ⌋ˢ)
      —↠ᶜᶜ⟨ multi-ξ-⨟₂ᶜᶜ h!⨟t↠j ⟩
      (G `?) ⨟ ⌊ j ⌋ⁱ
      ∎ᶜᶜ)

  normalize-seq (′ i) t
    with i i⨟s t
  ... | j , i⨟t↠j =
    ′ j , i⨟t↠j

  _i⨟s_ (G !ⁿ g) (idⁿ ★) =
    G !ⁿ g
    , (((G !) ⨟ (idᶜ ★)
      —→ᶜᶜ⟨ β-idRᶜ ⟩
      (G !)
      ∎ᶜᶜ))

  _i⨟s_ (ℕ !ⁿ G-ℕ) (ℕ ?ⁿ G-ℕ) =
    ＇ idℕ
    , (((ℕ !) ⨟ (ℕ `?)
      —→ᶜᶜ⟨ β-proj-inj-okᶜ ⟩
      idᶜ ℕ
      ∎ᶜᶜ))

  _i⨟s_ ((★ ⇒ ★) !ⁿ G-⇒) ((★ ⇒ ★) ?ⁿ G-⇒) =
    ＇ id★⇒★
    , ((((★ ⇒ ★) !) ⨟ ((★ ⇒ ★) `?)
      —→ᶜᶜ⟨ β-proj-inj-okᶜ ⟩
      idᶜ (★ ⇒ ★)
      ∎ᶜᶜ))

  _i⨟s_ {C = C} (ℕ !ⁿ G-ℕ) ((★ ⇒ ★) ?ⁿ G-⇒) =
    ⊥ⁿ ℕ ⇨ C
    , (((ℕ !) ⨟ ((★ ⇒ ★) `?)
      —→ᶜᶜ⟨ β-proj-inj-badᶜ (λ ()) ⟩
      (⊥ᶜ ℕ ⇨ (★ ⇒ ★))
      ∎ᶜᶜ))

  _i⨟s_ {C = C} ((★ ⇒ ★) !ⁿ G-⇒) (ℕ ?ⁿ G-ℕ) =
    ⊥ⁿ (★ ⇒ ★) ⇨ C
    , ((((★ ⇒ ★) !) ⨟ (ℕ `?)
      —→ᶜᶜ⟨ β-proj-inj-badᶜ (λ ()) ⟩
      (⊥ᶜ (★ ⇒ ★) ⇨ ℕ)
      ∎ᶜᶜ))

  _i⨟s_ (ℕ !ⁿ G-ℕ) (ℕ ?ⁿ G-ℕ ⨾ i) =
    i
    , (((ℕ !) ⨟ (((ℕ `?)) ⨟ ⌊ i ⌋ⁱ)
      —→ᶜᶜ⟨ β-assocLᶜ ⟩
      (((ℕ !) ⨟ (ℕ `?)) ⨟ ⌊ i ⌋ⁱ)
      —→ᶜᶜ⟨ ξ-⨟₁ᶜ β-proj-inj-okᶜ ⟩
      ((idᶜ ℕ) ⨟ ⌊ i ⌋ⁱ)
      —→ᶜᶜ⟨ β-idLᶜ ⟩
      ⌊ i ⌋ⁱ
      ∎ᶜᶜ))

  _i⨟s_ ((★ ⇒ ★) !ⁿ G-⇒) ((★ ⇒ ★) ?ⁿ G-⇒ ⨾ i) =
    i
    , ((((★ ⇒ ★) !) ⨟ (((★ ⇒ ★) `?) ⨟ ⌊ i ⌋ⁱ)
      —→ᶜᶜ⟨ β-assocLᶜ ⟩
      ((((★ ⇒ ★) !) ⨟ ((★ ⇒ ★) `?)) ⨟ ⌊ i ⌋ⁱ)
      —→ᶜᶜ⟨ ξ-⨟₁ᶜ β-proj-inj-okᶜ ⟩
      ((idᶜ (★ ⇒ ★)) ⨟ ⌊ i ⌋ⁱ)
      —→ᶜᶜ⟨ β-idLᶜ ⟩
      ⌊ i ⌋ⁱ
      ∎ᶜᶜ))

  _i⨟s_ {C = C} (ℕ !ⁿ G-ℕ) ((★ ⇒ ★) ?ⁿ G-⇒ ⨾ i) =
    ⊥ⁿ ℕ ⇨ C
    , (((ℕ !) ⨟ (((★ ⇒ ★) `?) ⨟ ⌊ i ⌋ⁱ)
      —→ᶜᶜ⟨ β-assocLᶜ ⟩
      (((ℕ !) ⨟ ((★ ⇒ ★) `?)) ⨟ ⌊ i ⌋ⁱ)
      —→ᶜᶜ⟨ ξ-⨟₁ᶜ (β-proj-inj-badᶜ (λ ())) ⟩
      ((⊥ᶜ ℕ ⇨ (★ ⇒ ★)) ⨟ ⌊ i ⌋ⁱ)
      —→ᶜᶜ⟨ β-⊥Lᶜ (wtI i) ⟩
      (⊥ᶜ ℕ ⇨ C)
      ∎ᶜᶜ))

  _i⨟s_ {C = C} ((★ ⇒ ★) !ⁿ G-⇒) (ℕ ?ⁿ G-ℕ ⨾ i) =
    ⊥ⁿ (★ ⇒ ★) ⇨ C
    , ((((★ ⇒ ★) !) ⨟ (((ℕ `?)) ⨟ ⌊ i ⌋ⁱ)
      —→ᶜᶜ⟨ β-assocLᶜ ⟩
      ((((★ ⇒ ★) !) ⨟ (ℕ `?)) ⨟ ⌊ i ⌋ⁱ)
      —→ᶜᶜ⟨ ξ-⨟₁ᶜ (β-proj-inj-badᶜ (λ ())) ⟩
      ((⊥ᶜ (★ ⇒ ★) ⇨ ℕ) ⨟ ⌊ i ⌋ⁱ)
      —→ᶜᶜ⟨ β-⊥Lᶜ (wtI i) ⟩
      (⊥ᶜ (★ ⇒ ★) ⇨ C)
      ∎ᶜᶜ))

  _i⨟s_ {C = C} (G !ⁿ g) (′ (⊥ⁿ ★ ⇨ C)) =
    ⊥ⁿ G ⇨ C
      , (((G !) ⨟ (⊥ᶜ ★ ⇨ C)
      —→ᶜᶜ⟨ β-!⊥ᶜ ⟩
      (⊥ᶜ G ⇨ C)
      ∎ᶜᶜ))

  _i⨟s_ (ℕ !ⁿ G-ℕ) (ℕ ?ⁿ G-ℕ ⨾ k ⨾!)
    with idℕ g⨟g k
  ... | m , id⨟k↠m =
    ‹ ℕ › m ⨾ G-ℕ !ⁿ
    , ((((ℕ !) ⨟ (((ℕ `?) ⨟ ⌊ k ⌋ᵍ) ⨟ (ℕ !)))
      —→ᶜᶜ⟨ β-assocLᶜ ⟩
      (((ℕ !) ⨟ ((ℕ `?) ⨟ ⌊ k ⌋ᵍ)) ⨟ (ℕ !))
      —→ᶜᶜ⟨ ξ-⨟₁ᶜ β-assocLᶜ ⟩
      ((((ℕ !) ⨟ (ℕ `?)) ⨟ ⌊ k ⌋ᵍ) ⨟ (ℕ !))
      —→ᶜᶜ⟨ ξ-⨟₁ᶜ (ξ-⨟₁ᶜ β-proj-inj-okᶜ) ⟩
      (((idᶜ ℕ) ⨟ ⌊ k ⌋ᵍ) ⨟ (ℕ !))
      —↠ᶜᶜ⟨ multi-ξ-⨟₁ᶜᶜ id⨟k↠m ⟩
      (⌊ m ⌋ᵍ ⨟ (ℕ !))
      ∎ᶜᶜ))

  _i⨟s_ ((★ ⇒ ★) !ⁿ G-⇒) ((★ ⇒ ★) ?ⁿ G-⇒ ⨾ k ⨾!)
    with id★⇒★ g⨟g k
  ... | m , id⨟k↠m =
    ‹ (★ ⇒ ★) › m ⨾ G-⇒ !ⁿ
    , (((((★ ⇒ ★) !) ⨟ ((((★ ⇒ ★) `?) ⨟ ⌊ k ⌋ᵍ) ⨟ ((★ ⇒ ★) !)))
      —→ᶜᶜ⟨ β-assocLᶜ ⟩
      ((((★ ⇒ ★) !) ⨟ (((★ ⇒ ★) `?) ⨟ ⌊ k ⌋ᵍ)) ⨟ ((★ ⇒ ★) !))
      —→ᶜᶜ⟨ ξ-⨟₁ᶜ β-assocLᶜ ⟩
      (((((★ ⇒ ★) !) ⨟ ((★ ⇒ ★) `?)) ⨟ ⌊ k ⌋ᵍ) ⨟ ((★ ⇒ ★) !))
      —→ᶜᶜ⟨ ξ-⨟₁ᶜ (ξ-⨟₁ᶜ β-proj-inj-okᶜ) ⟩
      (((idᶜ (★ ⇒ ★)) ⨟ ⌊ k ⌋ᵍ) ⨟ ((★ ⇒ ★) !))
      —↠ᶜᶜ⟨ multi-ξ-⨟₁ᶜᶜ id⨟k↠m ⟩
      (⌊ m ⌋ᵍ ⨟ ((★ ⇒ ★) !))
      ∎ᶜᶜ))

  _i⨟s_ {A = A} (ℕ !ⁿ G-ℕ) ((★ ⇒ ★) ?ⁿ G-⇒ ⨾ k ⨾!) =
    ⊥ⁿ A ⇨ ★
    , ((((ℕ !) ⨟ ((((★ ⇒ ★) `?) ⨟ ⌊ k ⌋ᵍ) ⨟ ((★ ⇒ ★) !)))
      —→ᶜᶜ⟨ β-assocLᶜ ⟩
      (((ℕ !) ⨟ (((★ ⇒ ★) `?) ⨟ ⌊ k ⌋ᵍ)) ⨟ ((★ ⇒ ★) !))
      —→ᶜᶜ⟨ ξ-⨟₁ᶜ β-assocLᶜ ⟩
      ((((ℕ !) ⨟ ((★ ⇒ ★) `?)) ⨟ ⌊ k ⌋ᵍ) ⨟ ((★ ⇒ ★) !))
      —→ᶜᶜ⟨ ξ-⨟₁ᶜ (ξ-⨟₁ᶜ (β-proj-inj-badᶜ (λ ()))) ⟩
      (((⊥ᶜ ℕ ⇨ (★ ⇒ ★)) ⨟ ⌊ k ⌋ᵍ) ⨟ ((★ ⇒ ★) !))
      —→ᶜᶜ⟨ ξ-⨟₁ᶜ (β-⊥Lᶜ (wtG k)) ⟩
      ((⊥ᶜ ℕ ⇨ (★ ⇒ ★)) ⨟ ((★ ⇒ ★) !))
      —→ᶜᶜ⟨ β-⊥Lᶜ (⊢! G-⇒) ⟩
      (⊥ᶜ ℕ ⇨ ★)
      ∎ᶜᶜ))

  _i⨟s_ {A = A} ((★ ⇒ ★) !ⁿ G-⇒) (ℕ ?ⁿ G-ℕ ⨾ k ⨾!) =
    ⊥ⁿ A ⇨ ★
    , (((((★ ⇒ ★) !) ⨟ (((ℕ `?) ⨟ ⌊ k ⌋ᵍ) ⨟ (ℕ !)))
      —→ᶜᶜ⟨ β-assocLᶜ ⟩
      ((((★ ⇒ ★) !) ⨟ ((ℕ `?) ⨟ ⌊ k ⌋ᵍ)) ⨟ (ℕ !))
      —→ᶜᶜ⟨ ξ-⨟₁ᶜ β-assocLᶜ ⟩
      (((((★ ⇒ ★) !) ⨟ (ℕ `?)) ⨟ ⌊ k ⌋ᵍ) ⨟ (ℕ !))
      —→ᶜᶜ⟨ ξ-⨟₁ᶜ (ξ-⨟₁ᶜ (β-proj-inj-badᶜ (λ ()))) ⟩
      (((⊥ᶜ (★ ⇒ ★) ⇨ ℕ) ⨟ ⌊ k ⌋ᵍ) ⨟ (ℕ !))
      —→ᶜᶜ⟨ ξ-⨟₁ᶜ (β-⊥Lᶜ (wtG k)) ⟩
      ((⊥ᶜ (★ ⇒ ★) ⇨ ℕ) ⨟ (ℕ !))
      —→ᶜᶜ⟨ β-⊥Lᶜ (⊢! G-ℕ) ⟩
      (⊥ᶜ (★ ⇒ ★) ⇨ ★)
      ∎ᶜᶜ))

  _i⨟s_ (‹ G › g ⨾ gnd !ⁿ) (idⁿ ★) =
    ‹ G › g ⨾ gnd !ⁿ
    , (((⌊ g ⌋ᵍ ⨟ (G !)) ⨟ (idᶜ ★))
      —→ᶜᶜ⟨ β-idRᶜ ⟩
      (⌊ g ⌋ᵍ ⨟ (G !))
      ∎ᶜᶜ)

  _i⨟s_ (‹ ℕ › g ⨾ G-ℕ !ⁿ) (ℕ ?ⁿ G-ℕ) =
    ＇ g
    , ((((⌊ g ⌋ᵍ ⨟ (ℕ !)) ⨟ (ℕ `?))
      —→ᶜᶜ⟨ β-assocRᶜ ⟩
      (⌊ g ⌋ᵍ ⨟ ((ℕ !) ⨟ (ℕ `?)))
      —→ᶜᶜ⟨ ξ-⨟₂ᶜ β-proj-inj-okᶜ ⟩
      (⌊ g ⌋ᵍ ⨟ idᶜ ℕ)
      —→ᶜᶜ⟨ β-idRᶜ ⟩
      ⌊ g ⌋ᵍ
      ∎ᶜᶜ))

  _i⨟s_ {C = C} (‹ ℕ › idℕ ⨾ G-ℕ !ⁿ) ((★ ⇒ ★) ?ⁿ G-⇒) =
    ⊥ⁿ ℕ ⇨ (★ ⇒ ★)
    , ((((idᶜ ℕ ⨟ (ℕ !)) ⨟ ((★ ⇒ ★) `?))
      —→ᶜᶜ⟨ β-assocRᶜ ⟩
      (idᶜ ℕ ⨟ ((ℕ !) ⨟ ((★ ⇒ ★) `?)))
      —→ᶜᶜ⟨ ξ-⨟₂ᶜ (β-proj-inj-badᶜ (λ ())) ⟩
      (idᶜ ℕ ⨟ (⊥ᶜ ℕ ⇨ (★ ⇒ ★)))
      —→ᶜᶜ⟨ β-idLᶜ ⟩
      (⊥ᶜ ℕ ⇨ (★ ⇒ ★))
      ∎ᶜᶜ))

  _i⨟s_ (‹ (★ ⇒ ★) › g ⨾ G-⇒ !ⁿ) ((★ ⇒ ★) ?ⁿ G-⇒) =
    ＇ g
    , ((((⌊ g ⌋ᵍ ⨟ ((★ ⇒ ★) !)) ⨟ ((★ ⇒ ★) `?))
      —→ᶜᶜ⟨ β-assocRᶜ ⟩
      (⌊ g ⌋ᵍ ⨟ (((★ ⇒ ★) !) ⨟ ((★ ⇒ ★) `?)))
      —→ᶜᶜ⟨ ξ-⨟₂ᶜ β-proj-inj-okᶜ ⟩
      (⌊ g ⌋ᵍ ⨟ idᶜ (★ ⇒ ★))
      —→ᶜᶜ⟨ β-idRᶜ ⟩
      ⌊ g ⌋ᵍ
      ∎ᶜᶜ))

  _i⨟s_ {C = C} (‹ (★ ⇒ ★) › id★⇒★ ⨾ G-⇒ !ⁿ) (ℕ ?ⁿ G-ℕ) =
    ⊥ⁿ (★ ⇒ ★) ⇨ ℕ
    , ((((idᶜ (★ ⇒ ★) ⨟ ((★ ⇒ ★) !)) ⨟ (ℕ `?))
      —→ᶜᶜ⟨ β-assocRᶜ ⟩
      (idᶜ (★ ⇒ ★) ⨟ (((★ ⇒ ★) !) ⨟ (ℕ `?)))
      —→ᶜᶜ⟨ ξ-⨟₂ᶜ (β-proj-inj-badᶜ (λ ())) ⟩
      (idᶜ (★ ⇒ ★) ⨟ (⊥ᶜ (★ ⇒ ★) ⇨ ℕ))
      —→ᶜᶜ⟨ β-idLᶜ ⟩
      (⊥ᶜ (★ ⇒ ★) ⇨ ℕ)
      ∎ᶜᶜ))

  _i⨟s_ {A = A₁ ⇒ B₁} (‹ (★ ⇒ ★) › (c ↣ d) ⨾ G-⇒ !ⁿ) (ℕ ?ⁿ G-ℕ) =
    ⊥ⁿ (A₁ ⇒ B₁) ⇨ ℕ
    , ((((⌊ c ⌋ˢ ↦ ⌊ d ⌋ˢ) ⨟ ((★ ⇒ ★) !)) ⨟ (ℕ `?))
      —→ᶜᶜ⟨ β-assocRᶜ ⟩
      ((⌊ c ⌋ˢ ↦ ⌊ d ⌋ˢ) ⨟ (((★ ⇒ ★) !) ⨟ (ℕ `?)))
      —→ᶜᶜ⟨ ξ-⨟₂ᶜ (β-proj-inj-badᶜ (λ ())) ⟩
      ((⌊ c ⌋ˢ ↦ ⌊ d ⌋ˢ) ⨟ (⊥ᶜ (★ ⇒ ★) ⇨ ℕ))
      —→ᶜᶜ⟨ β-↦⊥ᶜ (wtS c) (wtS d) ⟩
      (⊥ᶜ (A₁ ⇒ B₁) ⇨ ℕ)
      ∎ᶜᶜ)

  _i⨟s_ (‹ ℕ › g ⨾ G-ℕ !ⁿ) (ℕ ?ⁿ G-ℕ ⨾ i)
    with g g⨟i i
  ... | j , g⨟i↠j =
    j
    , (((⌊ g ⌋ᵍ ⨟ (ℕ !)) ⨟ (((ℕ `?)) ⨟ ⌊ i ⌋ⁱ))
      —→ᶜᶜ⟨ β-assocRᶜ ⟩
      (⌊ g ⌋ᵍ ⨟ ((ℕ !) ⨟ (((ℕ `?)) ⨟ ⌊ i ⌋ⁱ)))
      —→ᶜᶜ⟨ ξ-⨟₂ᶜ β-assocLᶜ ⟩
      (⌊ g ⌋ᵍ ⨟ (((ℕ !) ⨟ (ℕ `?)) ⨟ ⌊ i ⌋ⁱ))
      —→ᶜᶜ⟨ ξ-⨟₂ᶜ (ξ-⨟₁ᶜ β-proj-inj-okᶜ) ⟩
      (⌊ g ⌋ᵍ ⨟ ((idᶜ ℕ) ⨟ ⌊ i ⌋ⁱ))
      —→ᶜᶜ⟨ ξ-⨟₂ᶜ β-idLᶜ ⟩
      (⌊ g ⌋ᵍ ⨟ ⌊ i ⌋ⁱ)
      —↠ᶜᶜ⟨ g⨟i↠j ⟩
      ⌊ j ⌋ⁱ
      ∎ᶜᶜ)

  _i⨟s_ {C = C} (‹ ℕ › idℕ ⨾ G-ℕ !ⁿ) ((★ ⇒ ★) ?ⁿ G-⇒ ⨾ i) =
    ⊥ⁿ ℕ ⇨ C
    , ((((idᶜ ℕ) ⨟ (ℕ !)) ⨟ (((★ ⇒ ★) `?) ⨟ ⌊ i ⌋ⁱ))
      —→ᶜᶜ⟨ β-assocRᶜ ⟩
      ((idᶜ ℕ) ⨟ ((ℕ !) ⨟ (((★ ⇒ ★) `?) ⨟ ⌊ i ⌋ⁱ)))
      —→ᶜᶜ⟨ ξ-⨟₂ᶜ β-assocLᶜ ⟩
      ((idᶜ ℕ) ⨟ (((ℕ !) ⨟ ((★ ⇒ ★) `?)) ⨟ ⌊ i ⌋ⁱ))
      —→ᶜᶜ⟨ ξ-⨟₂ᶜ (ξ-⨟₁ᶜ (β-proj-inj-badᶜ (λ ()))) ⟩
      ((idᶜ ℕ) ⨟ ((⊥ᶜ ℕ ⇨ (★ ⇒ ★)) ⨟ ⌊ i ⌋ⁱ))
      —→ᶜᶜ⟨ ξ-⨟₂ᶜ (β-⊥Lᶜ (wtI i)) ⟩
      ((idᶜ ℕ) ⨟ (⊥ᶜ ℕ ⇨ C))
      —→ᶜᶜ⟨ β-idLᶜ ⟩
      (⊥ᶜ ℕ ⇨ C)
      ∎ᶜᶜ)

  _i⨟s_ {A = A₁ ⇒ B₁} {C = C}
         (‹ (★ ⇒ ★) › (c ↣ d) ⨾ G-⇒ !ⁿ)
         (ℕ ?ⁿ G-ℕ ⨾ i) =
    ⊥ⁿ (A₁ ⇒ B₁) ⇨ C
    , ((((⌊ c ⌋ˢ ↦ ⌊ d ⌋ˢ) ⨟ ((★ ⇒ ★) !)) ⨟ (((ℕ `?)) ⨟ ⌊ i ⌋ⁱ))
      —→ᶜᶜ⟨ β-assocRᶜ ⟩
      ((⌊ c ⌋ˢ ↦ ⌊ d ⌋ˢ) ⨟ (((★ ⇒ ★) !) ⨟ (((ℕ `?)) ⨟ ⌊ i ⌋ⁱ)))
      —→ᶜᶜ⟨ ξ-⨟₂ᶜ β-assocLᶜ ⟩
      ((⌊ c ⌋ˢ ↦ ⌊ d ⌋ˢ) ⨟ ((((★ ⇒ ★) !) ⨟ (ℕ `?)) ⨟ ⌊ i ⌋ⁱ))
      —→ᶜᶜ⟨ ξ-⨟₂ᶜ (ξ-⨟₁ᶜ (β-proj-inj-badᶜ (λ ()))) ⟩
      ((⌊ c ⌋ˢ ↦ ⌊ d ⌋ˢ) ⨟ ((⊥ᶜ (★ ⇒ ★) ⇨ ℕ) ⨟ ⌊ i ⌋ⁱ))
      —→ᶜᶜ⟨ ξ-⨟₂ᶜ (β-⊥Lᶜ (wtI i)) ⟩
      ((⌊ c ⌋ˢ ↦ ⌊ d ⌋ˢ) ⨟ (⊥ᶜ (★ ⇒ ★) ⇨ C))
      —→ᶜᶜ⟨ β-↦⊥ᶜ (wtS c) (wtS d) ⟩
      (⊥ᶜ (A₁ ⇒ B₁) ⇨ C)
      ∎ᶜᶜ)

  _i⨟s_ {C = C} (‹ (★ ⇒ ★) › id★⇒★ ⨾ G-⇒ !ⁿ) (ℕ ?ⁿ G-ℕ ⨾ i) =
    ⊥ⁿ (★ ⇒ ★) ⇨ C
    , ((((idᶜ (★ ⇒ ★)) ⨟ ((★ ⇒ ★) !)) ⨟ (((ℕ `?)) ⨟ ⌊ i ⌋ⁱ))
      —→ᶜᶜ⟨ β-assocRᶜ ⟩
      ((idᶜ (★ ⇒ ★)) ⨟ (((★ ⇒ ★) !) ⨟ (((ℕ `?)) ⨟ ⌊ i ⌋ⁱ)))
      —→ᶜᶜ⟨ ξ-⨟₂ᶜ β-assocLᶜ ⟩
      ((idᶜ (★ ⇒ ★)) ⨟ ((((★ ⇒ ★) !) ⨟ (ℕ `?)) ⨟ ⌊ i ⌋ⁱ))
      —→ᶜᶜ⟨ ξ-⨟₂ᶜ (ξ-⨟₁ᶜ (β-proj-inj-badᶜ (λ ()))) ⟩
      ((idᶜ (★ ⇒ ★)) ⨟ ((⊥ᶜ (★ ⇒ ★) ⇨ ℕ) ⨟ ⌊ i ⌋ⁱ))
      —→ᶜᶜ⟨ ξ-⨟₂ᶜ (β-⊥Lᶜ (wtI i)) ⟩
      ((idᶜ (★ ⇒ ★)) ⨟ (⊥ᶜ (★ ⇒ ★) ⇨ C))
      —→ᶜᶜ⟨ β-idLᶜ ⟩
      (⊥ᶜ (★ ⇒ ★) ⇨ C)
      ∎ᶜᶜ)

  _i⨟s_ (‹ (★ ⇒ ★) › g ⨾ G-⇒ !ⁿ) ((★ ⇒ ★) ?ⁿ G-⇒ ⨾ i)
    with g g⨟i i
  ... | j , g⨟i↠j =
    j
    , ((((⌊ g ⌋ᵍ) ⨟ ((★ ⇒ ★) !)) ⨟ (((★ ⇒ ★) `?) ⨟ ⌊ i ⌋ⁱ))
      —→ᶜᶜ⟨ β-assocRᶜ ⟩
      ((⌊ g ⌋ᵍ) ⨟ (((★ ⇒ ★) !) ⨟ (((★ ⇒ ★) `?) ⨟ ⌊ i ⌋ⁱ)))
      —→ᶜᶜ⟨ ξ-⨟₂ᶜ β-assocLᶜ ⟩
      ((⌊ g ⌋ᵍ) ⨟ ((((★ ⇒ ★) !) ⨟ ((★ ⇒ ★) `?)) ⨟ ⌊ i ⌋ⁱ))
      —→ᶜᶜ⟨ ξ-⨟₂ᶜ (ξ-⨟₁ᶜ β-proj-inj-okᶜ) ⟩
      ((⌊ g ⌋ᵍ) ⨟ ((idᶜ (★ ⇒ ★)) ⨟ ⌊ i ⌋ⁱ))
      —→ᶜᶜ⟨ ξ-⨟₂ᶜ β-idLᶜ ⟩
      ((⌊ g ⌋ᵍ) ⨟ ⌊ i ⌋ⁱ)
      —↠ᶜᶜ⟨ g⨟i↠j ⟩
      ⌊ j ⌋ⁱ
      ∎ᶜᶜ)

  _i⨟s_ {C = C} (‹ ℕ › idℕ ⨾ G-ℕ !ⁿ) (′ (⊥ⁿ ★ ⇨ C)) =
    ⊥ⁿ ℕ ⇨ C
    , ((((idᶜ ℕ) ⨟ (ℕ !)) ⨟ (⊥ᶜ ★ ⇨ C))
      —→ᶜᶜ⟨ β-assocRᶜ ⟩
      ((idᶜ ℕ) ⨟ ((ℕ !) ⨟ (⊥ᶜ ★ ⇨ C)))
      —→ᶜᶜ⟨ ξ-⨟₂ᶜ β-!⊥ᶜ ⟩
      ((idᶜ ℕ) ⨟ (⊥ᶜ ℕ ⇨ C))
      —→ᶜᶜ⟨ β-idLᶜ ⟩
      (⊥ᶜ ℕ ⇨ C)
      ∎ᶜᶜ)

  _i⨟s_ {A = A₁ ⇒ B₁} {C = C}
         (‹ (★ ⇒ ★) › (c ↣ d) ⨾ G-⇒ !ⁿ)
         (′ (⊥ⁿ ★ ⇨ C)) =
    ⊥ⁿ (A₁ ⇒ B₁) ⇨ C
    , ((((⌊ c ⌋ˢ ↦ ⌊ d ⌋ˢ) ⨟ ((★ ⇒ ★) !)) ⨟ (⊥ᶜ ★ ⇨ C))
      —→ᶜᶜ⟨ β-assocRᶜ ⟩
      ((⌊ c ⌋ˢ ↦ ⌊ d ⌋ˢ) ⨟ (((★ ⇒ ★) !) ⨟ (⊥ᶜ ★ ⇨ C)))
      —→ᶜᶜ⟨ ξ-⨟₂ᶜ β-!⊥ᶜ ⟩
      ((⌊ c ⌋ˢ ↦ ⌊ d ⌋ˢ) ⨟ (⊥ᶜ (★ ⇒ ★) ⇨ C))
      —→ᶜᶜ⟨ β-↦⊥ᶜ (wtS c) (wtS d) ⟩
      (⊥ᶜ (A₁ ⇒ B₁) ⇨ C)
      ∎ᶜᶜ)

  _i⨟s_ {C = C} (‹ (★ ⇒ ★) › id★⇒★ ⨾ G-⇒ !ⁿ) (′ (⊥ⁿ ★ ⇨ C)) =
    ⊥ⁿ (★ ⇒ ★) ⇨ C
    , ((((idᶜ (★ ⇒ ★)) ⨟ ((★ ⇒ ★) !)) ⨟ (⊥ᶜ ★ ⇨ C))
      —→ᶜᶜ⟨ β-assocRᶜ ⟩
      ((idᶜ (★ ⇒ ★)) ⨟ (((★ ⇒ ★) !) ⨟ (⊥ᶜ ★ ⇨ C)))
      —→ᶜᶜ⟨ ξ-⨟₂ᶜ β-!⊥ᶜ ⟩
      ((idᶜ (★ ⇒ ★)) ⨟ (⊥ᶜ (★ ⇒ ★) ⇨ C))
      —→ᶜᶜ⟨ β-idLᶜ ⟩
      (⊥ᶜ (★ ⇒ ★) ⇨ C)
      ∎ᶜᶜ)

  _i⨟s_ (‹ ℕ › g ⨾ G-ℕ !ⁿ) (ℕ ?ⁿ G-ℕ ⨾ k ⨾!)
    with g g⨟g k
  ... | m , g⨟k↠m =
    ‹ ℕ › m ⨾ G-ℕ !ⁿ
    , ((((⌊ g ⌋ᵍ ⨟ (ℕ !)) ⨟ (((ℕ `?) ⨟ ⌊ k ⌋ᵍ) ⨟ (ℕ !)))
      —→ᶜᶜ⟨ β-assocRᶜ ⟩
      (⌊ g ⌋ᵍ ⨟ ((ℕ !) ⨟ (((ℕ `?) ⨟ ⌊ k ⌋ᵍ) ⨟ (ℕ !))))
      —→ᶜᶜ⟨ ξ-⨟₂ᶜ β-assocLᶜ ⟩
      (⌊ g ⌋ᵍ ⨟ (((ℕ !) ⨟ ((ℕ `?) ⨟ ⌊ k ⌋ᵍ)) ⨟ (ℕ !)))
      —→ᶜᶜ⟨ ξ-⨟₂ᶜ (ξ-⨟₁ᶜ β-assocLᶜ) ⟩
      (⌊ g ⌋ᵍ ⨟ ((((ℕ !) ⨟ (ℕ `?)) ⨟ ⌊ k ⌋ᵍ) ⨟ (ℕ !)))
      —→ᶜᶜ⟨ ξ-⨟₂ᶜ (ξ-⨟₁ᶜ (ξ-⨟₁ᶜ β-proj-inj-okᶜ)) ⟩
      (⌊ g ⌋ᵍ ⨟ (((idᶜ ℕ) ⨟ ⌊ k ⌋ᵍ) ⨟ (ℕ !)))
      —→ᶜᶜ⟨ β-assocLᶜ ⟩
      ((⌊ g ⌋ᵍ ⨟ ((idᶜ ℕ) ⨟ ⌊ k ⌋ᵍ)) ⨟ (ℕ !))
      —→ᶜᶜ⟨ ξ-⨟₁ᶜ β-assocLᶜ ⟩
      (((⌊ g ⌋ᵍ ⨟ idᶜ ℕ) ⨟ ⌊ k ⌋ᵍ) ⨟ (ℕ !))
      —→ᶜᶜ⟨ ξ-⨟₁ᶜ (ξ-⨟₁ᶜ β-idRᶜ) ⟩
      ((⌊ g ⌋ᵍ ⨟ ⌊ k ⌋ᵍ) ⨟ (ℕ !))
      —↠ᶜᶜ⟨ multi-ξ-⨟₁ᶜᶜ g⨟k↠m ⟩
      (⌊ m ⌋ᵍ ⨟ (ℕ !))
      ∎ᶜᶜ))

  _i⨟s_ (‹ (★ ⇒ ★) › g ⨾ G-⇒ !ⁿ) ((★ ⇒ ★) ?ⁿ G-⇒ ⨾ k ⨾!)
    with g g⨟g k
  ... | m , g⨟k↠m =
    ‹ (★ ⇒ ★) › m ⨾ G-⇒ !ⁿ
    , ((((⌊ g ⌋ᵍ ⨟ ((★ ⇒ ★) !)) ⨟ ((((★ ⇒ ★) `?) ⨟ ⌊ k ⌋ᵍ) ⨟ ((★ ⇒ ★) !)))
      —→ᶜᶜ⟨ β-assocRᶜ ⟩
      (⌊ g ⌋ᵍ ⨟ (((★ ⇒ ★) !) ⨟ ((((★ ⇒ ★) `?) ⨟ ⌊ k ⌋ᵍ) ⨟ ((★ ⇒ ★) !))))
      —→ᶜᶜ⟨ ξ-⨟₂ᶜ β-assocLᶜ ⟩
      (⌊ g ⌋ᵍ ⨟ ((((★ ⇒ ★) !) ⨟ (((★ ⇒ ★) `?) ⨟ ⌊ k ⌋ᵍ)) ⨟ ((★ ⇒ ★) !)))
      —→ᶜᶜ⟨ ξ-⨟₂ᶜ (ξ-⨟₁ᶜ β-assocLᶜ) ⟩
      (⌊ g ⌋ᵍ ⨟ (((((★ ⇒ ★) !) ⨟ ((★ ⇒ ★) `?)) ⨟ ⌊ k ⌋ᵍ) ⨟ ((★ ⇒ ★) !)))
      —→ᶜᶜ⟨ ξ-⨟₂ᶜ (ξ-⨟₁ᶜ (ξ-⨟₁ᶜ β-proj-inj-okᶜ)) ⟩
      (⌊ g ⌋ᵍ ⨟ (((idᶜ (★ ⇒ ★)) ⨟ ⌊ k ⌋ᵍ) ⨟ ((★ ⇒ ★) !)))
      —→ᶜᶜ⟨ β-assocLᶜ ⟩
      ((⌊ g ⌋ᵍ ⨟ ((idᶜ (★ ⇒ ★)) ⨟ ⌊ k ⌋ᵍ)) ⨟ ((★ ⇒ ★) !))
      —→ᶜᶜ⟨ ξ-⨟₁ᶜ β-assocLᶜ ⟩
      (((⌊ g ⌋ᵍ ⨟ idᶜ (★ ⇒ ★)) ⨟ ⌊ k ⌋ᵍ) ⨟ ((★ ⇒ ★) !))
      —→ᶜᶜ⟨ ξ-⨟₁ᶜ (ξ-⨟₁ᶜ β-idRᶜ) ⟩
      ((⌊ g ⌋ᵍ ⨟ ⌊ k ⌋ᵍ) ⨟ ((★ ⇒ ★) !))
      —↠ᶜᶜ⟨ multi-ξ-⨟₁ᶜᶜ g⨟k↠m ⟩
      (⌊ m ⌋ᵍ ⨟ ((★ ⇒ ★) !))
      ∎ᶜᶜ))

  _i⨟s_ (‹ ℕ › g ⨾ G-ℕ !ⁿ) ((★ ⇒ ★) ?ⁿ G-⇒ ⨾ k ⨾!)
    with g g⨟i (⊥ⁿ ℕ ⇨ ★)
  ... | j , g⨟⊥↠j =
    j
    , ((((⌊ g ⌋ᵍ ⨟ (ℕ !)) ⨟ ((((★ ⇒ ★) `?) ⨟ ⌊ k ⌋ᵍ) ⨟ ((★ ⇒ ★) !)))
      —→ᶜᶜ⟨ β-assocRᶜ ⟩
      (⌊ g ⌋ᵍ ⨟ ((ℕ !) ⨟ ((((★ ⇒ ★) `?) ⨟ ⌊ k ⌋ᵍ) ⨟ ((★ ⇒ ★) !))))
      —→ᶜᶜ⟨ ξ-⨟₂ᶜ β-assocLᶜ ⟩
      (⌊ g ⌋ᵍ ⨟ (((ℕ !) ⨟ (((★ ⇒ ★) `?) ⨟ ⌊ k ⌋ᵍ)) ⨟ ((★ ⇒ ★) !)))
      —→ᶜᶜ⟨ ξ-⨟₂ᶜ (ξ-⨟₁ᶜ β-assocLᶜ) ⟩
      (⌊ g ⌋ᵍ ⨟ ((((ℕ !) ⨟ ((★ ⇒ ★) `?)) ⨟ ⌊ k ⌋ᵍ) ⨟ ((★ ⇒ ★) !)))
      —→ᶜᶜ⟨ ξ-⨟₂ᶜ (ξ-⨟₁ᶜ (ξ-⨟₁ᶜ (β-proj-inj-badᶜ (λ ())))) ⟩
      (⌊ g ⌋ᵍ ⨟ (((⊥ᶜ ℕ ⇨ (★ ⇒ ★)) ⨟ ⌊ k ⌋ᵍ) ⨟ ((★ ⇒ ★) !)))
      —→ᶜᶜ⟨ ξ-⨟₂ᶜ (ξ-⨟₁ᶜ (β-⊥Lᶜ (wtG k))) ⟩
      (⌊ g ⌋ᵍ ⨟ ((⊥ᶜ ℕ ⇨ (★ ⇒ ★)) ⨟ ((★ ⇒ ★) !)))
      —→ᶜᶜ⟨ ξ-⨟₂ᶜ (β-⊥Lᶜ (⊢! G-⇒)) ⟩
      (⌊ g ⌋ᵍ ⨟ (⊥ᶜ ℕ ⇨ ★))
      —↠ᶜᶜ⟨ g⨟⊥↠j ⟩
      ⌊ j ⌋ⁱ
      ∎ᶜᶜ))

  _i⨟s_ (‹ (★ ⇒ ★) › g ⨾ G-⇒ !ⁿ) (ℕ ?ⁿ G-ℕ ⨾ k ⨾!)
    with g g⨟i (⊥ⁿ (★ ⇒ ★) ⇨ ★)
  ... | j , g⨟⊥↠j =
    j
    , ((((⌊ g ⌋ᵍ ⨟ ((★ ⇒ ★) !)) ⨟ (((ℕ `?) ⨟ ⌊ k ⌋ᵍ) ⨟ (ℕ !)))
      —→ᶜᶜ⟨ β-assocRᶜ ⟩
      (⌊ g ⌋ᵍ ⨟ (((★ ⇒ ★) !) ⨟ (((ℕ `?) ⨟ ⌊ k ⌋ᵍ) ⨟ (ℕ !))))
      —→ᶜᶜ⟨ ξ-⨟₂ᶜ β-assocLᶜ ⟩
      (⌊ g ⌋ᵍ ⨟ ((((★ ⇒ ★) !) ⨟ ((ℕ `?) ⨟ ⌊ k ⌋ᵍ)) ⨟ (ℕ !)))
      —→ᶜᶜ⟨ ξ-⨟₂ᶜ (ξ-⨟₁ᶜ β-assocLᶜ) ⟩
      (⌊ g ⌋ᵍ ⨟ (((((★ ⇒ ★) !) ⨟ (ℕ `?)) ⨟ ⌊ k ⌋ᵍ) ⨟ (ℕ !)))
      —→ᶜᶜ⟨ ξ-⨟₂ᶜ (ξ-⨟₁ᶜ (ξ-⨟₁ᶜ (β-proj-inj-badᶜ (λ ())))) ⟩
      (⌊ g ⌋ᵍ ⨟ (((⊥ᶜ (★ ⇒ ★) ⇨ ℕ) ⨟ ⌊ k ⌋ᵍ) ⨟ (ℕ !)))
      —→ᶜᶜ⟨ ξ-⨟₂ᶜ (ξ-⨟₁ᶜ (β-⊥Lᶜ (wtG k))) ⟩
      (⌊ g ⌋ᵍ ⨟ ((⊥ᶜ (★ ⇒ ★) ⇨ ℕ) ⨟ (ℕ !)))
      —→ᶜᶜ⟨ ξ-⨟₂ᶜ (β-⊥Lᶜ (⊢! G-ℕ)) ⟩
      (⌊ g ⌋ᵍ ⨟ (⊥ᶜ (★ ⇒ ★) ⇨ ★))
      —↠ᶜᶜ⟨ g⨟⊥↠j ⟩
      ⌊ j ⌋ⁱ
      ∎ᶜᶜ))

  _i⨟s_ {B = B} (＇ g) (idⁿ B) =
    ＇ g
    , (((⌊ g ⌋ᵍ) ⨟ (idᶜ B))
      —→ᶜᶜ⟨ β-idRᶜ ⟩
      ⌊ g ⌋ᵍ
      ∎ᶜᶜ)

  _i⨟s_ (＇ g) (′ i)
    with g g⨟i i
  ... | j , g⨟i↠j =
    j , g⨟i↠j

  _i⨟s_ {A = A} {B = B} {C = C} (⊥ⁿ A ⇨ B) t =
    ⊥ⁿ A ⇨ C
    , (((⊥ᶜ A ⇨ B) ⨟ ⌊ t ⌋ˢ)
      —→ᶜᶜ⟨ β-⊥Lᶜ (wtS t) ⟩
      (⊥ᶜ A ⇨ C)
      ∎ᶜᶜ)

  _g⨟i_ g (G !ⁿ gnd) =
    ‹ G › g ⨾ gnd !ⁿ
    , ((⌊ g ⌋ᵍ ⨟ (G !)) ∎ᶜᶜ)

  _g⨟i_ g (‹ G › h ⨾ gnd !ⁿ)
    with g g⨟g h
  ... | k , g⨟g↠k =
    ‹ G › k ⨾ gnd !ⁿ
    , ((⌊ g ⌋ᵍ ⨟ (⌊ h ⌋ᵍ ⨟ (G !)))
      —→ᶜᶜ⟨ β-assocLᶜ ⟩
      (((⌊ g ⌋ᵍ) ⨟ ⌊ h ⌋ᵍ) ⨟ (G !))
      —↠ᶜᶜ⟨ multi-ξ-⨟₁ᶜᶜ g⨟g↠k ⟩
      (⌊ k ⌋ᵍ ⨟ (G !))
      ∎ᶜᶜ)

  _g⨟i_ {C = C} idℕ (⊥ⁿ ℕ ⇨ C) =
    ⊥ⁿ ℕ ⇨ C
    , (((idᶜ ℕ) ⨟ (⊥ᶜ ℕ ⇨ C))
      —→ᶜᶜ⟨ β-idLᶜ ⟩
      (⊥ᶜ ℕ ⇨ C)
      ∎ᶜᶜ)

  _g⨟i_ {C = C} id★⇒★ (⊥ⁿ (★ ⇒ ★) ⇨ C) =
    ⊥ⁿ (★ ⇒ ★) ⇨ C
    , (((idᶜ (★ ⇒ ★)) ⨟ (⊥ᶜ (★ ⇒ ★) ⇨ C))
      —→ᶜᶜ⟨ β-idLᶜ ⟩
      (⊥ᶜ (★ ⇒ ★) ⇨ C)
      ∎ᶜᶜ)

  _g⨟i_ {A = A₁ ⇒ B₁} {B = C₁ ⇒ D₁} {C = E} (c ↣ d) (⊥ⁿ (C₁ ⇒ D₁) ⇨ E) =
    ⊥ⁿ (A₁ ⇒ B₁) ⇨ E
    , (((⌊ c ⌋ˢ ↦ ⌊ d ⌋ˢ) ⨟ (⊥ᶜ (C₁ ⇒ D₁) ⇨ E))
      —→ᶜᶜ⟨ β-↦⊥ᶜ (wtS c) (wtS d) ⟩
      (⊥ᶜ (A₁ ⇒ B₁) ⇨ E)
      ∎ᶜᶜ)

  _g⨟i_ g (＇ h)
    with g g⨟g h
  ... | k , g⨟g↠k =
    ＇ k , g⨟g↠k

  _g⨟g_ idℕ idℕ =
    idℕ
    , (((idᶜ ℕ) ⨟ (idᶜ ℕ))
      —→ᶜᶜ⟨ β-idLᶜ ⟩
      (idᶜ ℕ)
      ∎ᶜᶜ)

  _g⨟g_ id★⇒★ id★⇒★ =
    id★⇒★
    , (((idᶜ (★ ⇒ ★)) ⨟ (idᶜ (★ ⇒ ★)))
      —→ᶜᶜ⟨ β-idLᶜ ⟩
      (idᶜ (★ ⇒ ★))
      ∎ᶜᶜ)

  _g⨟g_ {A = ★ ⇒ ★} {B = ★ ⇒ ★} id★⇒★ (c ↣ d) =
    (c ↣ d)
    , (((idᶜ (★ ⇒ ★)) ⨟ (⌊ c ⌋ˢ ↦ ⌊ d ⌋ˢ))
      —→ᶜᶜ⟨ β-idLᶜ ⟩
      (⌊ c ⌋ˢ ↦ ⌊ d ⌋ˢ)
      ∎ᶜᶜ)

  _g⨟g_ {B = ★ ⇒ ★} {C = ★ ⇒ ★} (c ↣ d) id★⇒★ =
    (c ↣ d)
    , (((⌊ c ⌋ˢ ↦ ⌊ d ⌋ˢ) ⨟ (idᶜ (★ ⇒ ★)))
      —→ᶜᶜ⟨ β-idRᶜ ⟩
      (⌊ c ⌋ˢ ↦ ⌊ d ⌋ˢ)
      ∎ᶜᶜ)

  _g⨟g_ (c ↣ d) (c′ ↣ d′)
    with normalize-seq c′ c
  ... | lc , c′⨟c↠lc
    with normalize-seq d d′
  ... | rd , d⨟d′↠rd =
    (lc ↣ rd)
    , (((⌊ c ⌋ˢ ↦ ⌊ d ⌋ˢ) ⨟ (⌊ c′ ⌋ˢ ↦ ⌊ d′ ⌋ˢ))
      —→ᶜᶜ⟨ β-↦ᶜ ⟩
      ((⌊ c′ ⌋ˢ ⨟ ⌊ c ⌋ˢ) ↦ (⌊ d ⌋ˢ ⨟ ⌊ d′ ⌋ˢ))
      —↠ᶜᶜ⟨ multi-ξ-↦₁ᶜᶜ c′⨟c↠lc ⟩
      (⌊ lc ⌋ˢ ↦ (⌊ d ⌋ˢ ⨟ ⌊ d′ ⌋ˢ))
      —↠ᶜᶜ⟨ multi-ξ-↦₂ᶜᶜ d⨟d′↠rd ⟩
      (⌊ lc ⌋ˢ ↦ ⌊ rd ⌋ˢ)
      ∎ᶜᶜ)

ground-idⁿ : ∀ {G} → Ground G → G ⇨ᵍ G
ground-idⁿ G-ℕ = idℕ
ground-idⁿ G-⇒ = id★⇒★

inverse-erase
  : ∀ {c A B}
  → ⊢ c ⦂ A ⇨ B
  → Normalᶜ c
  → ∃[ s ] (⌊ s ⌋ˢ ≡ c)

inverse-erase {c = idᶜ A} ⊢idᶜ nf-id =
  idⁿ A , refl

inverse-erase {c = ℕ `?} (⊢? G-ℕ) (nf-? G-ℕ) =
  ℕ ?ⁿ G-ℕ , refl

inverse-erase {c = (★ ⇒ ★) `?} (⊢? G-⇒) (nf-? G-⇒) =
  (★ ⇒ ★) ?ⁿ G-⇒ , refl

inverse-erase {c = ℕ !} (⊢! G-ℕ) (nf-! G-ℕ) =
  ′ (ℕ !ⁿ G-ℕ) , refl

inverse-erase {c = (★ ⇒ ★) !} (⊢! G-⇒) (nf-! G-⇒) =
  ′ ((★ ⇒ ★) !ⁿ G-⇒) , refl

inverse-erase {c = (ℕ `?) ⨟ (ℕ !)}
  (⊢⨟ (⊢? G-ℕ) (⊢! G-ℕ)) (nf-?! G-ℕ) =
  ℕ ?ⁿ G-ℕ ⨾ (ℕ !ⁿ G-ℕ) , refl

inverse-erase {c = ((★ ⇒ ★) `?) ⨟ ((★ ⇒ ★) !)}
  (⊢⨟ (⊢? G-⇒) (⊢! G-⇒)) (nf-?! G-⇒) =
  (★ ⇒ ★) ?ⁿ G-⇒ ⨾ ((★ ⇒ ★) !ⁿ G-⇒) , refl

inverse-erase {c = c₁ ↦ c₂}
  (⊢↦ cwt dwt) (nf-↦ n₁ n₂)
  with inverse-erase cwt n₁ | inverse-erase dwt n₂
... | s₁ , eq₁ | s₂ , eq₂ =
  ′ (＇ (s₁ ↣ s₂)) , cong₂ _↦_ eq₁ eq₂

inverse-erase {c = (G `?) ⨟ (c₁ ↦ c₂)}
  (⊢⨟ (⊢? g) (⊢↦ cwt dwt)) (nf-?↦ _ n₁ n₂)
  with inverse-erase cwt n₁ | inverse-erase dwt n₂
... | s₁ , eq₁ | s₂ , eq₂ =
  G ?ⁿ g ⨾ (＇ (s₁ ↣ s₂))
  , cong (λ x → (G `?) ⨟ x) (cong₂ _↦_ eq₁ eq₂)

inverse-erase {c = (c₁ ↦ c₂) ⨟ ((★ ⇒ ★) !)}
  (⊢⨟ (⊢↦ cwt dwt) (⊢! G-⇒)) (nf-↦! n₁ n₂ G-⇒)
  with inverse-erase cwt n₁ | inverse-erase dwt n₂
... | s₁ , eq₁ | s₂ , eq₂ =
  ′ (‹ (★ ⇒ ★) › (s₁ ↣ s₂) ⨾ G-⇒ !ⁿ)
  , cong (λ x → x ⨟ ((★ ⇒ ★) !)) (cong₂ _↦_ eq₁ eq₂)

inverse-erase {c = ((★ ⇒ ★) `? ⨟ (c₁ ↦ c₂)) ⨟ ((★ ⇒ ★) !)}
  (⊢⨟ (⊢⨟ (⊢? G-⇒) (⊢↦ cwt dwt)) (⊢! G-⇒))
  (nf-?↦! G-⇒ n₁ n₂)
  with inverse-erase cwt n₁ | inverse-erase dwt n₂
... | s₁ , eq₁ | s₂ , eq₂ =
  (★ ⇒ ★) ?ⁿ G-⇒ ⨾ (s₁ ↣ s₂) ⨾!
  , cong (λ x → ((★ ⇒ ★) `? ⨟ x) ⨟ ((★ ⇒ ★) !)) (cong₂ _↦_ eq₁ eq₂)

inverse-erase {c = (G `?) ⨟ (⊥ᶜ A ⇨ B)}
  (⊢⨟ (⊢? g) ⊢⊥) (nf-?⊥ _) =
  G ?ⁿ g ⨾ (⊥ⁿ G ⇨ B) , refl

inverse-erase {c = ⊥ᶜ A ⇨ B} ⊢⊥ nf-⊥ =
  ′ (⊥ⁿ A ⇨ B) , refl

erase-normal
  : ∀ {A B}
  → (s : A ⇨ⁿ B)
  → ∃[ c ] (⌊ s ⌋ˢ —↠ᶜᶜ c) × Normalᶜ c
erase-normal s = normalizeᶜ (wtS s)

erase-produces-Normalᶜ
  : ∀ {A B}
  → (s : A ⇨ⁿ B)
  → ∃[ c ] (⌊ s ⌋ˢ —↠ᶜᶜ c) × Normalᶜ c
erase-produces-Normalᶜ = erase-normal
