module GTLC where

open import Agda.Builtin.Nat using (Nat; zero; suc)
open import Agda.Builtin.List using (List; []; _∷_)

data Ty : Set where
  ℕ   : Ty
  ★   : Ty
  _⇒_ : Ty → Ty → Ty

------------------------------------------------------------
-- Type Consistency
------------------------------------------------------------

infix 4 _~_

data _~_ : Ty → Ty → Set where
  ~-ℕ  : ℕ ~ ℕ
  ~-★ : ★ ~ ★
  ★~ℕ : ★ ~ ℕ
  ℕ~★ : ℕ ~ ★
  ★~⇒ : ∀{A B} → A ~ ★ → ★ ~ B → ★ ~ (A ⇒ B)
  ⇒~★ : ∀{A B} → ★ ~ A → B ~ ★ → (A ⇒ B) ~ ★
  ~-⇒  : ∀ {A B C D} → C ~ A → B ~ D → (A ⇒ B) ~ (C ⇒ D)

~-sym : ∀ {A B} → A ~ B → B ~ A
~-sym ~-ℕ = ~-ℕ
~-sym ~-★ = ~-★
~-sym ★~ℕ = ℕ~★
~-sym ℕ~★ = ★~ℕ
~-sym (★~⇒ A~★ ★~B) = ⇒~★ (~-sym A~★) (~-sym ★~B)
~-sym (⇒~★ ★~A B~★) = ★~⇒ (~-sym ★~A) (~-sym B~★)
~-sym (~-⇒ C~A B~D) = ~-⇒ (~-sym C~A) (~-sym B~D)

mutual
  ★~-ty : ∀ A → ★ ~ A
  ★~-ty ℕ = ★~ℕ
  ★~-ty ★ = ~-★
  ★~-ty (A ⇒ B) = ★~⇒ (~★-ty A) (★~-ty B)

  ~★-ty : ∀ A → A ~ ★
  ~★-ty ℕ = ℕ~★
  ~★-ty ★ = ~-★
  ~★-ty (A ⇒ B) = ⇒~★ (★~-ty A) (~★-ty B)

------------------------------------------------------------
-- Type Precision
------------------------------------------------------------

infix 4 _⊑_
data _⊑_ : Ty → Ty → Set where
  ⊑-ℕ : ℕ ⊑ ℕ
  ⊑-★ : ∀ {A} → ★ ⊑ A
  ⊑-⇒ : ∀ {A B C D} → A ⊑ C → B ⊑ D → (A ⇒ B) ⊑ (C ⇒ D)

⊑-refl : ∀ {A} → A ⊑ A
⊑-refl {A = ℕ} = ⊑-ℕ
⊑-refl {A = ★} = ⊑-★
⊑-refl {A = A ⇒ B} = ⊑-⇒ ⊑-refl ⊑-refl

Var : Set
Var = Nat

data Term : Set where
  `_    : Var → Term
  $_    : Nat → Term
  ƛ_⇒_  : Ty → Term → Term
  _·_   : Term → Term → Term

Ctx : Set
Ctx = List Ty

infix 4 _∋_⦂_

data _∋_⦂_ : Ctx → Var → Ty → Set where
  Z : ∀ {Γ A} → (A ∷ Γ) ∋ zero ⦂ A
  S : ∀ {Γ A B x} → Γ ∋ x ⦂ A → (B ∷ Γ) ∋ suc x ⦂ A

infix 4 _⊢_⦂_

data _⊢_⦂_ : Ctx → Term → Ty → Set where
  ⊢` : ∀ {Γ x A}
    → Γ ∋ x ⦂ A
      ----------------
    → Γ ⊢ ` x ⦂ A

  ⊢$ : ∀ {Γ n}
      ---------
    → Γ ⊢ $ n ⦂ ℕ

  ⊢ƛ : ∀ {Γ A N B}
    → (A ∷ Γ) ⊢ N ⦂ B
      -----------------------
    → Γ ⊢ ƛ A ⇒ N ⦂ (A ⇒ B)

  ⊢· : ∀ {Γ L M A A′ B}
    → Γ ⊢ L ⦂ (A ⇒ B)
    → Γ ⊢ M ⦂ A′ 
    → A′ ~ A
      ----------------
    → Γ ⊢ L · M ⦂ B

  ⊢·★ : ∀ {Γ L M A}
    → Γ ⊢ L ⦂ ★
    → Γ ⊢ M ⦂ A
      ----------------
    → Γ ⊢ L · M ⦂ ★

infix 4 _⊑ᵀ_

data _⊑ᵀ_ : Term → Term → Set where
  ⊑` : ∀ {x}
    → ` x ⊑ᵀ ` x

  ⊑$ : ∀ {n}
    → $ n ⊑ᵀ $ n

  ⊑ƛ : ∀ {A B N M}
    → A ⊑ B
    → N ⊑ᵀ M
    → ƛ A ⇒ N ⊑ᵀ ƛ B ⇒ M

  ⊑· : ∀ {L L′ M M′}
    → L ⊑ᵀ L′
    → M ⊑ᵀ M′
    → L · M ⊑ᵀ L′ · M′
