module GradualTermImprecision where

-- File Charter:
--   * Term imprecision for gradual terms.

open import Agda.Builtin.Equality using (_≡_)
open import Data.Bool using (true)
open import Data.List using (List; []; _∷_; map)
open import Data.Nat using (ℕ; zero; suc)

open import Types
open import Imprecision
open import Primitives using (Const; Prim; constTy; κℕ)
open import GradualTerms

------------------------------------------------------------------------
-- Gradual-term imprecision
------------------------------------------------------------------------

infix 4 _∣_∣_⊢ᴳ_⊑_⦂_
data _∣_∣_⊢ᴳ_⊑_⦂_ (Δ : TyCtx) (Φ : VarPrecCtx) (Π : List Imp) : GTerm → GTerm → Imp → Set₁ where

  x⊑x : ∀ {x}{A A′ : Ty}{p : Imp}
    → Π ∋ x ⦂ p
    ------------------------------
    → Δ ∣ Φ ∣ Π ⊢ᴳ (` x) ⊑ (` x) ⦂ p

  ƛ⊑ƛ : ∀ {A A′ : Ty}{M M′ : GTerm}{pA pB : Imp}
    → 0 ∣ Φ ⊢ pA ⦂ A ⊑ A′
    → Δ ∣ Φ ∣ pA ∷ Π ⊢ᴳ M ⊑ M′ ⦂ pB
    ----------------------------------------------------------
    → Δ ∣ Φ ∣ Π ⊢ᴳ (ƛ A ⇒ M) ⊑ (ƛ A′ ⇒ M′) ⦂ pA ↦ pB

  ·⊑· : ∀ {L L′ M M′}{pA pB pA′ : Imp}
    → Δ ∣ Φ ∣ Π ⊢ᴳ L ⊑ L′ ⦂ pA ↦ pB
    → Δ ∣ Φ ∣ Π ⊢ᴳ M ⊑ M′ ⦂ pA′
    ---------------------------------------
    → Δ ∣ Φ ∣ Π ⊢ᴳ (L · M) ⊑ (L′ · M′) ⦂ pB

  Λ⊑Λ : ∀ {M M′}{pA : Imp}
    → Value M
    → Value M′
    → suc Δ ∣ X⊑X ∷ Φ ∣ map ⇑⊑ Π ⊢ᴳ M ⊑ M′ ⦂ pA
    -------------------------------------------
    → Δ ∣ Φ ∣ Π ⊢ᴳ (Λ M) ⊑ (Λ M′) ⦂ ‵∀ pA

  Λ⊑ : ∀ {M M′}{pA : Imp}
    → Value M 
    → occurs zero (src⊑ pA) ≡ true
    → suc Δ ∣ X⊑★ ∷ Φ  ∣ map ⇑⊑ Π ⊢ᴳ M ⊑ ⇑ᵗᴳ M′ ⦂ pA 
    -----------------------------------------
    → Δ ∣ Φ ∣ Π ⊢ᴳ (Λ M) ⊑ M′ ⦂ ν pA

  []⊑[] : ∀ {M M′ T T′}{pA pT : Imp} 
    → Δ ∣ Φ ∣ Π ⊢ᴳ M ⊑ M′ ⦂ ‵∀ pA
    → 0 ∣ Φ ⊢ pT ⦂ T ⊑ T′ 
    ------------------------------------------------------
    → Δ ∣ Φ ∣ Π ⊢ᴳ (M `[ T ]) ⊑ (M′ `[ T′ ]) ⦂ pA [ pT ]⊑ᵢ

  []⊑ : ∀ {M M′ T}{pA pT : Imp} 
    → Δ ∣ Φ ∣ Π ⊢ᴳ M ⊑ M′ ⦂ ν pA 
    → 0 ∣ Φ ⊢ pT ⦂ T ⊑ ★ 
    --------------------------------------------
    → Δ ∣ Φ ∣ Π ⊢ᴳ (M `[ T ]) ⊑ M′ ⦂ pA [ pT ]⊑ᵢ

  $⊑$ : ∀ {n}
    --------------------------------------------------
    → Δ ∣ Φ ∣ Π ⊢ᴳ ($ (κℕ n)) ⊑ ($ (κℕ n)) ⦂ idι `ℕ

  ⊕⊑⊕ : ∀ {L L′ M M′ op} {pAB pA}
    → Δ ∣ Φ ∣ Π ⊢ᴳ L ⊑ L′ ⦂ pAB
    → Δ ∣ Φ ∣ Π ⊢ᴳ M ⊑ M′ ⦂ pA
    ---------------------------------------------------------
    → Δ ∣ Φ ∣ Π ⊢ᴳ (L ⊕[ op ] M) ⊑ (L′ ⊕[ op ] M′) ⦂ idι `ℕ
